Ran Plan for dir: `examples/aws` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.edge-aws.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.edge-aws.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.edge-aws.aws_appautoscaling_policy.autoscaling_policy[0] will be created
+ resource "aws_appautoscaling_policy" "autoscaling_policy" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "test"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "replication-group/test"
      + scalable_dimension = "elasticache:replication-group:NodeGroups"
      + service_namespace  = "elasticache"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ElastiCacheDatabaseMemoryUsageCountedForEvictPercentage"
            }
        }
    }

  # module.edge-aws.aws_appautoscaling_target.autoscaling_target[0] will be created
+ resource "aws_appautoscaling_target" "autoscaling_target" {
      + id                 = (known after apply)
      + max_capacity       = 100
      + min_capacity       = 3
      + resource_id        = "replication-group/test"
      + role_arn           = (known after apply)
      + scalable_dimension = "elasticache:replication-group:NodeGroups"
      + service_namespace  = "elasticache"
    }

  # module.edge-aws.aws_iam_policy.lb_controller_policy will be created
+ resource "aws_iam_policy" "lb_controller_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "testIdentiqAWSLBCIAMPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + iam:AWSServiceName = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                          + StringEquals = {
                              + ec2:CreateAction = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.edge-aws.aws_iam_policy.worker_autoscaling will be created
+ resource "aws_iam_policy" "worker_autoscaling" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "test-worker-autoscaling"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "eksWorkerAutoscalingAll"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled = "true"
                              + autoscaling:ResourceTag/kubernetes.io/cluster/test        = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "eksWorkerAutoscalingOwn"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.edge-aws.aws_security_group.pinky_ingress will be created
+ resource "aws_security_group" "pinky_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from member to idq API"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "identiq-vpc-pinky-ingress"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "identiq-vpc-pinky-ingress"
        }
      + tags_all               = {
          + "Name" = "identiq-vpc-pinky-ingress"
        }
      + vpc_id                 = (known after apply)
    }

  # module.edge-aws.aws_vpc_endpoint.ep[0] will be created
+ resource "aws_vpc_endpoint" "ep" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.vpce.us-east-1.vpce-svc-0964eccd96e1f130c"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.edge-aws.kubernetes_annotations.gp2 will be created
+ resource "kubernetes_annotations" "gp2" {
      + annotations = {
          + "storageclass.kubernetes.io/is-default-class" = "false"
        }
      + api_version = "storage.k8s.io/v1"
      + force       = true
      + id          = (known after apply)
      + kind        = "StorageClass"

      + metadata {
          + name = "gp2"
        }
    }

  # module.edge-aws.kubernetes_config_map.version will be created
+ resource "kubernetes_config_map" "version" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "identiq-version"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.edge-aws.kubernetes_secret.edge_db_secret[0] will be created
+ resource "kubernetes_secret" "edge_db_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "edge-postgresql"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.edge-aws.kubernetes_secret.edge_redis_secret[0] will be created
+ resource "kubernetes_secret" "edge_redis_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "edge-identities-redis"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.edge-aws.kubernetes_service.edge_db_service[0] will be created
+ resource "kubernetes_service" "edge_db_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "ad.datadoghq.com/service.check_names"  = jsonencode(
                    [
                      + "postgres",
                    ]
                )
              + "ad.datadoghq.com/service.init_configs" = jsonencode(
                    [
                      + {},
                    ]
                )
              + "ad.datadoghq.com/service.instances"    = jsonencode(
                    [
                      + {
                          + collect_activity_metrics = "true"
                          + collect_default_database = "true"
                          + dbm                      = "true"
                          + host                     = "edge-postgresql"
                          + ignore_databases         = []
                          + password                 = "%%env_PGSQL_PASS%%"
                          + query_metrics            = {
                              + enabled = "true"
                            }
                          + username                 = "edge"
                        },
                    ]
                )
            }
          + generation       = (known after apply)
          + name             = "edge-postgresql"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_name               = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + session_affinity            = "None"
          + type                        = "ExternalName"
        }
    }

  # module.edge-aws.kubernetes_service.edge_redis_service[0] will be created
+ resource "kubernetes_service" "edge_redis_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "ad.datadoghq.com/service.check_names"  = jsonencode(
                    [
                      + "redisdb",
                    ]
                )
              + "ad.datadoghq.com/service.init_configs" = jsonencode(
                    [
                      + {},
                    ]
                )
              + "ad.datadoghq.com/service.instances"    = jsonencode(
                    [
                      + {
                          + host = "edge-identities-redis-master"
                          + port = "6379"
                        },
                    ]
                )
            }
          + generation       = (known after apply)
          + name             = "edge-identities-redis-master"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_name               = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + session_affinity            = "None"
          + type                        = "ExternalName"
        }
    }

  # module.edge-aws.kubernetes_storage_class.ssd will be created
+ resource "kubernetes_storage_class" "ssd" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "encrypted" = "true"
          + "fsType"    = "ext4"
          + "type"      = "gp2"
        }
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "kubernetes.io/aws-ebs"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + annotations      = {
              + "storageclass.kubernetes.io/is-default-class" = "true"
            }
          + generation       = (known after apply)
          + name             = "ssd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.edge-aws.random_password.rds_password[0] will be created
+ resource "random_password" "rds_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.edge-aws.module.eks.data.aws_ami.eks_worker[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ami" "eks_worker"  {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + creation_date         = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "amazon",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "amazon-eks-node-1.22-v*",
            ]
        }
    }

  # module.edge-aws.module.eks.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.edge-aws.module.eks.data.aws_iam_policy_document.cluster_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_assume_role_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSClusterAssumeRole"

          + principals {
              + identifiers = [
                  + "eks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.edge-aws.module.eks.data.aws_iam_policy_document.cluster_deny_log_group[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_deny_log_group"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Deny"
          + resources = [
              + "*",
            ]
        }
    }

  # module.edge-aws.module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_elb_sl_role_creation"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:DescribeAccountAttributes",
              + "ec2:DescribeAddresses",
              + "ec2:DescribeInternetGateways",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.edge-aws.module.eks.data.aws_iam_policy_document.workers_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "workers_assume_role_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSWorkerAssumeRole"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Service"
            }
        }
    }

  # module.edge-aws.module.eks.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.edge-aws.module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.edge-aws.module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
+ resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 0
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 0
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "test-db"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "lowest-price"
              + spot_instance_pools                      = 1
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "m5.large"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "test-db-eks_asg"
        }
      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/test"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.edge-aws.module.eks.aws_autoscaling_group.workers_launch_template[1] will be created
+ resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 0
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 0
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "test-cache"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "lowest-price"
              + spot_instance_pools                      = 1
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "r5.large"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "test-cache-eks_asg"
        }
      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/test"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.edge-aws.module.eks.aws_autoscaling_group.workers_launch_template[2] will be created
+ resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 20
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "test-dynamic"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = 20
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "lowest-price"
              + spot_instance_pools                      = 1
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "c5.2xlarge"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "test-dynamic-eks_asg"
        }
      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/label/edge.identiq.com/role"
          + propagate_at_launch = true
          + value               = "dynamic"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/node-template/taint/dynamic"
          + propagate_at_launch = true
          + value               = "true:NoSchedule"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/test"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/test"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.edge-aws.module.eks.aws_autoscaling_group.workers_launch_template[3] will be created
+ resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "test-base"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = "prioritized"
              + on_demand_base_capacity                  = 1
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "lowest-price"
              + spot_instance_pools                      = 10
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = "c5.2xlarge"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "test-base-eks_asg"
        }
      + tag {
          + key                 = "Terraform"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/test"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.edge-aws.module.eks.aws_eks_cluster.this[0] will be created
+ resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "test"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Terraform" = "true"
        }
      + version               = "1.22"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.edge-aws.module.eks.aws_iam_instance_profile.workers_launch_template[0] will be created
+ resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_instance_profile.workers_launch_template[1] will be created
+ resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_instance_profile.workers_launch_template[2] will be created
+ resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_instance_profile.workers_launch_template[3] will be created
+ resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_policy.cluster_deny_log_group[0] will be created
+ resource "aws_iam_policy" "cluster_deny_log_group" {
      + arn         = (known after apply)
      + description = "Deny CreateLogGroup"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test-deny-log-group"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
    }

  # module.edge-aws.module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
+ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test-elb-sl-role-creation"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
    }

  # module.edge-aws.module.eks.aws_iam_role.cluster[0] will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test"
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.edge-aws.module.eks.aws_iam_role.workers[0] will be created
+ resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test"
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_deny_log_group" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
+ resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
+ resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.workers_additional_policies[0] will be created
+ resource "aws_iam_role_policy_attachment" "workers_additional_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_iam_role_policy_attachment.workers_additional_policies[1] will be created
+ resource "aws_iam_role_policy_attachment" "workers_additional_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.edge-aws.module.eks.aws_launch_template.workers_launch_template[0] will be created
+ resource "aws_launch_template" "workers_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = (known after apply)
      + instance_type          = "m4.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-db"
      + tags                   = {
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Terraform" = "true"
        }
      + update_default_version = false
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"      = "test-db-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"      = "test-db-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"      = "test-db-eks_asg"
              + "Terraform" = "true"
            }
        }
    }

  # module.edge-aws.module.eks.aws_launch_template.workers_launch_template[1] will be created
+ resource "aws_launch_template" "workers_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = (known after apply)
      + instance_type          = "m4.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-cache"
      + tags                   = {
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Terraform" = "true"
        }
      + update_default_version = false
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"      = "test-cache-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"      = "test-cache-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"      = "test-cache-eks_asg"
              + "Terraform" = "true"
            }
        }
    }

  # module.edge-aws.module.eks.aws_launch_template.workers_launch_template[2] will be created
+ resource "aws_launch_template" "workers_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = (known after apply)
      + instance_type          = "m4.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-dynamic"
      + tags                   = {
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Terraform" = "true"
        }
      + update_default_version = false
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                                                                = "test-dynamic-eks_asg"
              + "Terraform"                                                           = "true"
              + "k8s.io/cluster-autoscaler/enabled"                                   = "true"
              + "k8s.io/cluster-autoscaler/node-template/label/edge.identiq.com/role" = "dynamic"
              + "k8s.io/cluster-autoscaler/node-template/taint/dynamic"               = "true:NoSchedule"
              + "k8s.io/cluster-autoscaler/test"                                      = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"      = "test-dynamic-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                                                                = "test-dynamic-eks_asg"
              + "Terraform"                                                           = "true"
              + "k8s.io/cluster-autoscaler/enabled"                                   = "true"
              + "k8s.io/cluster-autoscaler/node-template/label/edge.identiq.com/role" = "dynamic"
              + "k8s.io/cluster-autoscaler/node-template/taint/dynamic"               = "true:NoSchedule"
              + "k8s.io/cluster-autoscaler/test"                                      = "owned"
            }
        }
    }

  # module.edge-aws.module.eks.aws_launch_template.workers_launch_template[3] will be created
+ resource "aws_launch_template" "workers_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = (known after apply)
      + instance_type          = "m4.large"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-base"
      + tags                   = {
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Terraform" = "true"
        }
      + update_default_version = false
      + user_data              = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = 0
              + throughput            = (known after apply)
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + enclave_options {
          + enabled = false
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"      = "test-base-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"      = "test-base-eks_asg"
              + "Terraform" = "true"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"      = "test-base-eks_asg"
              + "Terraform" = "true"
            }
        }
    }

  # module.edge-aws.module.eks.aws_security_group.cluster[0] will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "test-eks_cluster_sg"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Name"      = "test-eks_cluster_sg"
          + "Terraform" = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.edge-aws.module.eks.aws_security_group.workers[0] will be created
+ resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                       = "test-eks_worker_sg"
          + "Terraform"                  = "true"
          + "kubernetes.io/cluster/test" = "owned"
        }
      + tags_all               = {
          + "Name
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.